Revit 2026 API

# HardwoodHardwoodImperfections Property

---

The property labeled "Relief Pattern" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodImperfections { get; }
```
```vb
Public Shared ReadOnly Property HardwoodImperfections As String
	Get
```
```cpp
public:
static property String^ HardwoodImperfections {
	String^ get ();
}
```
```fsharp
static member HardwoodImperfections : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodImperfectionsType".

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace